app/controllers/pins_controller.rb

	def index
		@pins = Pin.all.order("created_at DESC")
---
SELECT "pins".* FROM "pins"  ORDER BY created_at DESC

	def create
		@pin = Pin.new(pin_params)

		if @pin.save
---
INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "second Pin"], ["description", "haseum\r\n"], ["user_id", 1], ["created_at", "2015-04-16 05:51:01.763036"], ["updated_at", "2015-04-16 05:51:01.763036"]]

	def update
		if @pin.update(pin_params)
---
UPDATE "pins" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["image_file_name", "jake-rocheleau-250.jpg"], ["image_file_size", 17689], ["image_updated_at", "2015-04-16 06:56:44.125755"], ["updated_at", "2015-04-16 06:56:44.207076"], ["id", 1]]

	def find_pin
		@pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 5]]